const heavenlyStems = {
  4: '甲',
  5: '乙',
  6: '丙',
  7: '丁',
  8: '戊',
  9: '己',
  10: '庚',
  1: '辛',
  2: '壬',
  3: '癸'
}

const earthlyBranch = {
  4: '子',
  5: '丑',
  6: '寅',
  7: '卯',
  8: '辰',
  9: '巳',
  10: '午',
  11: '未',
  12: '申',
  1: '酉',
  2: '戌',
  3: '亥'
}

const placeDayMap = {
  '甲': `${'正东方'}, ${'在男性手中'}, ${'距丢失之地约5里'}`,
  '乙': `${'正南方'}, ${'在女性手中'}, ${'距丢失之地千里之遥'}`,
  '丙': `${'西南方'}, ${'在小孩手中'}, ${'距丢失之地约10里'}`,
  '丁': `${'西北方'}, ${'在亲人手中'}, ${'距丢失之地约3里'}`,
  '戊': `${'正北方'}, ${'在家里'}, ${'就在身边'}`,
  '己': `${'东南方'}, ${'在男性手中'}, ${'距丢失之地约5里'}`,
  '庚': `${'正西方'}, ${'在女性手中'}, ${'距丢失之地千里之遥'}`,
  '辛': `${'西南方'}, ${'在小孩手中'}, ${'距丢失之地约10里'}`,
  '壬': `${'东北方'}, ${'在亲人手中'}, ${'距丢失之地约3里'}`,
  '癸': `${'东北方'}, ${'在家里'}, ${'就在身边'}`
}

const placeTimeMap = {
  '子': `${'去路旁找'}`,
  '丑': `${'并没有丢，就在身边'}`,
  '寅': `${'落入他人手，找不回了'}`,
  '卯': `${'去路旁找'}`,
  '辰': `${'并没有丢，就在身边'}`,
  '巳': `${'落入他人手，找不回了'}`,
  '午': `${'去路旁找'}`,
  '未': `${'并没有丢，就在身边'}`,
  '申': `${'落入他人手，找不回了'}`,
  '酉': `${'去路旁找'}`,
  '戌': `${'并没有丢，就在身边'}`,
  '亥': `${'落入他人手，找不回了'}`
}

module.exports = {
  heavenlyStems,
  earthlyBranch,
  placeDayMap,
  placeTimeMap
}